RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_TMPSNS.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TMPSNS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMPSNS_Peripheral_Access_Layer TMPSNS Peripheral Access Layer
 * @{
 */

/** TMPSNS - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL0;                             /**< Temperature Sensor Control Register 0, offset: 0x0 */
  __IO uint32_t CTRL0_SET;                         /**< Temperature Sensor Control Register 0, offset: 0x4 */
  __IO uint32_t CTRL0_CLR;                         /**< Temperature Sensor Control Register 0, offset: 0x8 */
  __IO uint32_t CTRL0_TOG;                         /**< Temperature Sensor Control Register 0, offset: 0xC */
  __IO uint32_t CTRL1;                             /**< Temperature Sensor Control Register 1, offset: 0x10 */
  __IO uint32_t CTRL1_SET;                         /**< Temperature Sensor Control Register 1, offset: 0x14 */
  __IO uint32_t CTRL1_CLR;                         /**< Temperature Sensor Control Register 1, offset: 0x18 */
  __IO uint32_t CTRL1_TOG;                         /**< Temperature Sensor Control Register 1, offset: 0x1C */
  __IO uint32_t RANGE0;                            /**< Temperature Sensor Range Register 0, offset: 0x20 */
  __IO uint32_t RANGE0_SET;                        /**< Temperature Sensor Range Register 0, offset: 0x24 */
  __IO uint32_t RANGE0_CLR;                        /**< Temperature Sensor Range Register 0, offset: 0x28 */
  __IO uint32_t RANGE0_TOG;                        /**< Temperature Sensor Range Register 0, offset: 0x2C */
  __IO uint32_t RANGE1;                            /**< Temperature Sensor Range Register 1, offset: 0x30 */
  __IO uint32_t RANGE1_SET;                        /**< Temperature Sensor Range Register 1, offset: 0x34 */
  __IO uint32_t RANGE1_CLR;                        /**< Temperature Sensor Range Register 1, offset: 0x38 */
  __IO uint32_t RANGE1_TOG;                        /**< Temperature Sensor Range Register 1, offset: 0x3C */
       uint8_t RESERVED_0[16];
  __IO uint32_t STATUS0;                           /**< Temperature Sensor Status Register 0, offset: 0x50 */
} TMPSNS_Type;

/* ----------------------------------------------------------------------------
   -- TMPSNS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMPSNS_Register_Masks TMPSNS Register Masks
 * @{
 */

/*! @name CTRL0 - Temperature Sensor Control Register 0 */
/*! @{ */

#define TMPSNS_CTRL0_SLOPE_CAL_MASK              (0x3FU)
#define TMPSNS_CTRL0_SLOPE_CAL_SHIFT             (0U)
/*! SLOPE_CAL - Ramp slope calibration control */
#define TMPSNS_CTRL0_SLOPE_CAL(x)                (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_SLOPE_CAL_SHIFT)) & TMPSNS_CTRL0_SLOPE_CAL_MASK)

#define TMPSNS_CTRL0_V_SEL_MASK                  (0x300U)
#define TMPSNS_CTRL0_V_SEL_SHIFT                 (8U)
/*! V_SEL - Voltage Select
 *  0b00..Normal temperature measuring mode
 *  0b01-0b10..Reserved
 */
#define TMPSNS_CTRL0_V_SEL(x)                    (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_V_SEL_SHIFT)) & TMPSNS_CTRL0_V_SEL_MASK)

#define TMPSNS_CTRL0_IBIAS_TRIM_MASK             (0xF000U)
#define TMPSNS_CTRL0_IBIAS_TRIM_SHIFT            (12U)
/*! IBIAS_TRIM - Current bias trim value */
#define TMPSNS_CTRL0_IBIAS_TRIM(x)               (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_IBIAS_TRIM_SHIFT)) & TMPSNS_CTRL0_IBIAS_TRIM_MASK)
/*! @} */

/*! @name CTRL0_SET - Temperature Sensor Control Register 0 */
/*! @{ */

#define TMPSNS_CTRL0_SET_SLOPE_CAL_MASK          (0x3FU)
#define TMPSNS_CTRL0_SET_SLOPE_CAL_SHIFT         (0U)
/*! SLOPE_CAL - Ramp slope calibration control */
#define TMPSNS_CTRL0_SET_SLOPE_CAL(x)            (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_SET_SLOPE_CAL_SHIFT)) & TMPSNS_CTRL0_SET_SLOPE_CAL_MASK)

#define TMPSNS_CTRL0_SET_V_SEL_MASK              (0x300U)
#define TMPSNS_CTRL0_SET_V_SEL_SHIFT             (8U)
/*! V_SEL - Voltage Select */
#define TMPSNS_CTRL0_SET_V_SEL(x)                (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_SET_V_SEL_SHIFT)) & TMPSNS_CTRL0_SET_V_SEL_MASK)

#define TMPSNS_CTRL0_SET_IBIAS_TRIM_MASK         (0xF000U)
#define TMPSNS_CTRL0_SET_IBIAS_TRIM_SHIFT        (12U)
/*! IBIAS_TRIM - Current bias trim value */
#define TMPSNS_CTRL0_SET_IBIAS_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_SET_IBIAS_TRIM_SHIFT)) & TMPSNS_CTRL0_SET_IBIAS_TRIM_MASK)
/*! @} */

/*! @name CTRL0_CLR - Temperature Sensor Control Register 0 */
/*! @{ */

#define TMPSNS_CTRL0_CLR_SLOPE_CAL_MASK          (0x3FU)
#define TMPSNS_CTRL0_CLR_SLOPE_CAL_SHIFT         (0U)
/*! SLOPE_CAL - Ramp slope calibration control */
#define TMPSNS_CTRL0_CLR_SLOPE_CAL(x)            (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_CLR_SLOPE_CAL_SHIFT)) & TMPSNS_CTRL0_CLR_SLOPE_CAL_MASK)

#define TMPSNS_CTRL0_CLR_V_SEL_MASK              (0x300U)
#define TMPSNS_CTRL0_CLR_V_SEL_SHIFT             (8U)
/*! V_SEL - Voltage Select */
#define TMPSNS_CTRL0_CLR_V_SEL(x)                (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_CLR_V_SEL_SHIFT)) & TMPSNS_CTRL0_CLR_V_SEL_MASK)

#define TMPSNS_CTRL0_CLR_IBIAS_TRIM_MASK         (0xF000U)
#define TMPSNS_CTRL0_CLR_IBIAS_TRIM_SHIFT        (12U)
/*! IBIAS_TRIM - Current bias trim value */
#define TMPSNS_CTRL0_CLR_IBIAS_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_CLR_IBIAS_TRIM_SHIFT)) & TMPSNS_CTRL0_CLR_IBIAS_TRIM_MASK)
/*! @} */

/*! @name CTRL0_TOG - Temperature Sensor Control Register 0 */
/*! @{ */

#define TMPSNS_CTRL0_TOG_SLOPE_CAL_MASK          (0x3FU)
#define TMPSNS_CTRL0_TOG_SLOPE_CAL_SHIFT         (0U)
/*! SLOPE_CAL - Ramp slope calibration control */
#define TMPSNS_CTRL0_TOG_SLOPE_CAL(x)            (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_TOG_SLOPE_CAL_SHIFT)) & TMPSNS_CTRL0_TOG_SLOPE_CAL_MASK)

#define TMPSNS_CTRL0_TOG_V_SEL_MASK              (0x300U)
#define TMPSNS_CTRL0_TOG_V_SEL_SHIFT             (8U)
/*! V_SEL - Voltage Select */
#define TMPSNS_CTRL0_TOG_V_SEL(x)                (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_TOG_V_SEL_SHIFT)) & TMPSNS_CTRL0_TOG_V_SEL_MASK)

#define TMPSNS_CTRL0_TOG_IBIAS_TRIM_MASK         (0xF000U)
#define TMPSNS_CTRL0_TOG_IBIAS_TRIM_SHIFT        (12U)
/*! IBIAS_TRIM - Current bias trim value */
#define TMPSNS_CTRL0_TOG_IBIAS_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL0_TOG_IBIAS_TRIM_SHIFT)) & TMPSNS_CTRL0_TOG_IBIAS_TRIM_MASK)
/*! @} */

/*! @name CTRL1 - Temperature Sensor Control Register 1 */
/*! @{ */

#define TMPSNS_CTRL1_FREQ_MASK                   (0xFFFFU)
#define TMPSNS_CTRL1_FREQ_SHIFT                  (0U)
/*! FREQ - Temperature Measurement Frequency
 *  0b0000000000000000..Single Reading Mode. New reading available every time CTRL1[START] bit is set to 1 from 0.
 *  0b0000000000000001-0b1111111111111111..Continuous Reading Mode. Next temperature reading taken after programmed number of cycles after current reading is complete.
 */
#define TMPSNS_CTRL1_FREQ(x)                     (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL1_FREQ_SHIFT)) & TMPSNS_CTRL1_FREQ_MASK)

#define TMPSNS_CTRL1_FINISH_IE_MASK              (0x10000U)
#define TMPSNS_CTRL1_FINISH_IE_SHIFT             (16U)
/*! FINISH_IE - Measurement finished interrupt enable
 *  0b0..Interrupt is disabled
 *  0b1..Interrupt is enabled
 */
#define TMPSNS_CTRL1_FINISH_IE(x)                (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL1_FINISH_IE_SHIFT)) & TMPSNS_CTRL1_FINISH_IE_MASK)

#define TMPSNS_CTRL1_LOW_TEMP_IE_MASK            (0x20000U)
#define TMPSNS_CTRL1_LOW_TEMP_IE_SHIFT           (17U)
/*! LOW_TEMP_IE - Low temperature interrupt enable
 *  0b0..Interrupt is disabled
 *  0b1..Interrupt is enabled
 */
#define TMPSNS_CTRL1_LOW_TEMP_IE(x)              (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL1_LOW_TEMP_IE_SHIFT)) & TMPSNS_CTRL1_LOW_TEMP_IE_MASK)

#define TMPSNS_CTRL1_HIGH_TEMP_IE_MASK           (0x40000U)
#define TMPSNS_CTRL1_HIGH_TEMP_IE_SHIFT          (18U)
/*! HIGH_TEMP_IE - High temperature interrupt enable
 *  0b0..Interrupt is disabled
 *  0b1..Interrupt is enabled
 */
#define TMPSNS_CTRL1_HIGH_TEMP_IE(x)             (((uint32_t)(((uint32_t)(x)) << TMPSNS_CTRL1_HIGH_TEMP_IE_SHIFT)) & TMPSNS_CTRL1_HIGH_TEMP_IE_MASK)

